index_month = int(input("Введите номер месяца от 1 до 12: "))

dict_month = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето",
              7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

list_month = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето",
              "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]

print(f"Решение через словарь: {index_month} месяц относится к времени года: {dict_month[index_month]}")
print(f'Решение через список: {index_month} месяц относится к времени года: {list_month[index_month - 1]}')
